data/stackoverflow-snippets/php/837

<?php 
// xml post structure
$xml_post_string = '<?xml version="1.0" encoding="utf-8"?>
                    <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:hub="https://example.com/WebService?WSDL">
                       <soapenv:Header/>
                       <soapenv:Body>
                          <hub:depositos>
                             <!--Optional:-->
                             <hub:solicitud>
                                <Contrato>123456</Contrato>
                                <FechaInicio>11/07/2017</FechaInicio>
                                <!--Optional:-->
                                <FechaFin>11/07/2017</FechaFin>
                             </hub:solicitud>
                          </hub:depositos>
                       </soapenv:Body>
                    </soapenv:Envelope>';

$headers = array(
    "Content-type: text/xml;charset=\"utf-8\"",
    "Accept: text/xml",
    "Cache-Control: no-cache",
    "Pragma: no-cache",
    "SOAPAction: ''",
    "Content-length: ".strlen($xml_post_string),
    "Username: xxx@gmail.com",
    "Password: notrealpwd"
);

// PHP cURL  for https connection with auth
$ch = curl_init();
curl_setopt($ch, CURLOPT_SSL_VERIFYPEER, 1);
curl_setopt($ch, CURLOPT_URL, $ws_url);
curl_setopt($ch, CURLOPT_RETURNTRANSFER, true);
curl_setopt($ch, CURLOPT_HTTPAUTH, CURLAUTH_ANY);
curl_setopt($ch, CURLOPT_TIMEOUT, 10);
curl_setopt($ch, CURLOPT_POST, true);
curl_setopt($ch, CURLOPT_POSTFIELDS, $xml_post_string); // the SOAP request
curl_setopt($ch, CURLOPT_HTTPHEADER, $headers);

// converting
$response = curl_exec($ch);
